Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSent_regdef.h
/**
 * \file IfxSent_regdef.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC39XA_ITS_V3.0.R0
 * Specification: tc39x_its_sent_MCSFR_V1.39.xml
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Sent Sent
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Sent_Bitfields Bitfields
 * \ingroup IfxLld_Sent
 * 
 * \defgroup IfxLld_Sent_union Union
 * \ingroup IfxLld_Sent
 * 
 * \defgroup IfxLld_Sent_struct Struct
 * \ingroup IfxLld_Sent
 * 
 */
#ifndef IFXSENT_REGDEF_H
#define IFXSENT_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Sent_Bitfields
 * \{  */

/** \brief  Access Enable Register 0 */
typedef struct _Ifx_SENT_ACCEN0_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access E0able for Master TAG ID n (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access E1able for Master TAG ID n (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access E2able for Master TAG ID n (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access E3able for Master TAG ID n (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access E4able for Master TAG ID n (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access E5able for Master TAG ID n (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access E6able for Master TAG ID n (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access E7able for Master TAG ID n (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access E8able for Master TAG ID n (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access E9able for Master TAG ID n (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access E10able for Master TAG ID n (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access E11able for Master TAG ID n (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access E12able for Master TAG ID n (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access E13able for Master TAG ID n (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access E14able for Master TAG ID n (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access E15able for Master TAG ID n (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access E16able for Master TAG ID n (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access E17able for Master TAG ID n (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access E18able for Master TAG ID n (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access E19able for Master TAG ID n (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access E20able for Master TAG ID n (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access E21able for Master TAG ID n (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access E22able for Master TAG ID n (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access E23able for Master TAG ID n (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access E24able for Master TAG ID n (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access E25able for Master TAG ID n (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access E26able for Master TAG ID n (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access E27able for Master TAG ID n (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access E28able for Master TAG ID n (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access E29able for Master TAG ID n (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access E30able for Master TAG ID n (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access E31able for Master TAG ID n (rw) */
} Ifx_SENT_ACCEN0_Bits;

/** \brief  Access Enable Register 1 */
typedef struct _Ifx_SENT_ACCEN1_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_SENT_ACCEN1_Bits;

/** \brief  Channel Fractional Divider Register */
typedef struct _Ifx_SENT_CH_CFDR_Bits
{
    unsigned int DIV:16;                    /**< \brief [15:0] Divider Value (rw) */
    unsigned int DIVM:16;                   /**< \brief [31:16] Measured Divider Value (rh) */
} Ifx_SENT_CH_CFDR_Bits;

/** \brief  Channel Pre Divider Register */
typedef struct _Ifx_SENT_CH_CPDR_Bits
{
    unsigned int PDIV:12;                   /**< \brief [11:0] Divider Factor of Pre Divider for Channel x (rw) */
    unsigned int reserved_12:20;            /**< \brief \internal Reserved */
} Ifx_SENT_CH_CPDR_Bits;

/** \brief  Interrupt Node Pointer Register */
typedef struct _Ifx_SENT_CH_INP_Bits
{
    unsigned int RSI:4;                     /**< \brief [3:0] Interrupt Node Pointer for Interrupt RSI (rw) */
    unsigned int RDI:4;                     /**< \brief [7:4] Interrupt Node Pointer for Interrupt RDI (rw) */
    unsigned int RBI:4;                     /**< \brief [11:8] Interrupt Node Pointer for Interrupt RBI (rw) */
    unsigned int TDI:4;                     /**< \brief [15:12] Interrupt Node Pointer for Interrupt TDI (rw) */
    unsigned int TBI:4;                     /**< \brief [19:16] Interrupt Node Pointer for Interrupt TBI (rw) */
    unsigned int ERRI:4;                    /**< \brief [23:20] Interrupt Node Pointer for Interrupt FRI, FDI, NNI, NVI, CRCI, WSI, SCRI (rw) */
    unsigned int SDI:4;                     /**< \brief [27:24] Interrupt Node Pointer for Interrupt SDI (rw) */
    unsigned int WDI:4;                     /**< \brief [31:28] Interrupt Node Pointer for Interrupt WDI (rw) */
} Ifx_SENT_CH_INP_Bits;

