Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSent_regdef.h
/** \brief  Serial Data and Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_CH_SDS_Bits B;                 /**< \brief Bitfield access */
} Ifx_SENT_CH_SDS;

/** \brief  Receive Data View Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_CH_VIEW_Bits B;                /**< \brief Bitfield access */
} Ifx_SENT_CH_VIEW;

/** \brief  Watch Dog Timer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_CH_WDT_Bits B;                 /**< \brief Bitfield access */
} Ifx_SENT_CH_WDT;

/** \brief  Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_CLC_Bits B;                    /**< \brief Bitfield access */
} Ifx_SENT_CLC;

/** \brief  SENT Fractional Divider Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_FDR_Bits B;                    /**< \brief Bitfield access */
} Ifx_SENT_FDR;

/** \brief  Module Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_ID_Bits B;                     /**< \brief Bitfield access */
} Ifx_SENT_ID;

/** \brief  Interrupt Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_INTOV_Bits B;                  /**< \brief Bitfield access */
} Ifx_SENT_INTOV;

/** \brief  Kernel Reset Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_KRST0_Bits B;                  /**< \brief Bitfield access */
} Ifx_SENT_KRST0;

/** \brief  Kernel Reset Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_KRST1_Bits B;                  /**< \brief Bitfield access */
} Ifx_SENT_KRST1;

/** \brief  Kernel Reset Status Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_KRSTCLR_Bits B;                /**< \brief Bitfield access */
} Ifx_SENT_KRSTCLR;

/** \brief  OCDS Control and Status */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_OCS_Bits B;                    /**< \brief Bitfield access */
} Ifx_SENT_OCS;

/** \brief  Receive Data Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_RDR_Bits B;                    /**< \brief Bitfield access */
} Ifx_SENT_RDR;

/** \brief  Receive Time Stamp Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_RTS_Bits B;                    /**< \brief Bitfield access */
} Ifx_SENT_RTS;

/** \brief  Time Stamp Predivider Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_TPD_Bits B;                    /**< \brief Bitfield access */
} Ifx_SENT_TPD;

/** \brief  Module Time Stamp Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SENT_TSR_Bits B;                    /**< \brief Bitfield access */
} Ifx_SENT_TSR;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Sent_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \brief  Channel objects */
typedef volatile struct _Ifx_SENT_CH
{
    Ifx_SENT_CH_CPDR CPDR;                  /**< \brief 0, Channel Pre Divider Register */
    Ifx_SENT_CH_CFDR CFDR;                  /**< \brief 4, Channel Fractional Divider Register */
    Ifx_SENT_CH_RCR RCR;                    /**< \brief 8, Receiver Control Register */
    Ifx_SENT_CH_RSR RSR;                    /**< \brief C, Receive Status Register */
    Ifx_SENT_CH_SDS SDS;                    /**< \brief 10, Serial Data and Status Register */
    Ifx_SENT_CH_IOCR IOCR;                  /**< \brief 14, Input and Output Control Register */
    Ifx_SENT_CH_SCR SCR;                    /**< \brief 18, SPC Control Register */
    Ifx_SENT_CH_VIEW VIEW;                  /**< \brief 1C, Receive Data View Register */
    Ifx_SENT_CH_INTSTAT INTSTAT;            /**< \brief 20, Interrupt Status Register */
    Ifx_SENT_CH_INTSET INTSET;              /**< \brief 24, Interrupt Set Register */
    Ifx_SENT_CH_INTCLR INTCLR;              /**< \brief 28, Interrupt Clear Register */
    Ifx_SENT_CH_INTEN INTEN;                /**< \brief 2C, Interrupt Enable Register */
    Ifx_SENT_CH_INP INP;                    /**< \brief 30, Interrupt Node Pointer Register */
    Ifx_SENT_CH_WDT WDT;                    /**< \brief 34, Watch Dog Timer Register */
    unsigned char reserved_38[8];           /**< \brief 38, \internal Reserved */
} Ifx_SENT_CH;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Sent_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief  SENT object */
typedef volatile struct _Ifx_SENT
{
    Ifx_SENT_CLC CLC;                       /**< \brief 0, Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_SENT_ID ID;                         /**< \brief 8, Module Identification Register */
    Ifx_SENT_FDR FDR;                       /**< \brief C, SENT Fractional Divider Register */
    unsigned char reserved_10[4];           /**< \brief 10, \internal Reserved */
    Ifx_SENT_INTOV INTOV;                   /**< \brief 14, Interrupt Overview Register */
    Ifx_SENT_TSR TSR;                       /**< \brief 18, Module Time Stamp Register */
    Ifx_SENT_TPD TPD;                       /**< \brief 1C, Time Stamp Predivider Register */
    unsigned char reserved_20[96];          /**< \brief 20, \internal Reserved */
    Ifx_SENT_RDR RDR[25];                   /**< \brief 80, Receive Data Register */
    unsigned char reserved_E4[4];           /**< \brief E4, \internal Reserved */
    Ifx_SENT_OCS OCS;                       /**< \brief E8, OCDS Control and Status */
    Ifx_SENT_KRSTCLR KRSTCLR;               /**< \brief EC, Kernel Reset Status Clear Register */
    Ifx_SENT_KRST1 KRST1;                   /**< \brief F0, Kernel Reset Register 1 */
    Ifx_SENT_KRST0 KRST0;                   /**< \brief F4, Kernel Reset Register 0 */
    Ifx_SENT_ACCEN1 ACCEN1;                 /**< \brief F8, Access Enable Register 1 */
    Ifx_SENT_ACCEN0 ACCEN0;                 /**< \brief FC, Access Enable Register 0 */
    Ifx_SENT_CH CH[25];                     /**< \brief 100, Channel objects */
    unsigned char reserved_740[832];        /**< \brief 740, \internal Reserved */
    Ifx_SENT_RTS RTS[25];                   /**< \brief A80, Receive Time Stamp Register */
    unsigned char reserved_AE4[28];         /**< \brief AE4, \internal Reserved */
} Ifx_SENT;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSENT_REGDEF_H */
